GHB2/src/Reports/гхб_ЗакрепленныеСтатусыКонсервацииГрафик/гхб_ЗакрепленныеСтатусыКонсервацииГрафик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гхб_ЗакрепленныеСтатусыКонсервацииГрафик</name>
</mdclass:Report>

GHB2/src/InformationRegisters/гхб_СвойстваПомещений/гхб_СвойстваПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СвойстваПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Локация</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Корпус</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСтроения</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПомещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДробнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Площадь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПомещения</name>
    <type>
      <types>CatalogRef.гхб_ТипыПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановоеКоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетРабочихМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УточняющаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНаГенеральномПлане</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступВПомещениеПоКлючу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОхраннойСигнализации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомерКТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеКТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеДоступаСВысшимРуководителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщегоПользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_ОтветственныеЗаКонсервациюПомещений/гхб_ОтветственныеЗаКонсервациюПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_ОтветственныеЗаКонсервациюПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Закрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтветственныйЗаКонсервациюПомещения</name>
    <type>
      <types>CatalogRef.гхб_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_АктуальныеДокументыКонсервацииПомещений/гхб_АктуальныеДокументыКонсервацииПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_АктуальныеДокументыКонсервацииПомещений</name>
  <attributes>
    <name>ДокументКонсервации</name>
    <type>
      <types>DocumentRef.гхб_ЗакреплениеСтатусаКонсервацииПомещения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Reports/гхб_ЗакрепленныеСтатусыКонсервацииГрафик/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПользНастройкаДата1 = ПользовательскаяНастройкаПараметра("ДатаНачала", КомпоновщикНастроек);
	ПользНастройкаДата2 = ПользовательскаяНастройкаПараметра("ДатаОкончания", КомпоновщикНастроек);
	
		//Запрос = Новый Запрос();
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	_Даты.Дата КАК Дата,
		//               |	_Даты.ДатаСтрокаЗаголовка КАК ДатаСтрокаЗаголовка,
		//               |	_Даты.СтатусКонсервации КАК СтатусКонсервации,
		//               |	_Даты.Помещение КАК Помещение
		//               |ПОМЕСТИТЬ _Помещения
		//               |ИЗ
		//               |	&ТЗПериоды КАК _Даты
		//               |
		//               |ИНДЕКСИРОВАТЬ ПО
		//               |	Дата
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	НАЧАЛОПЕРИОДА(гхб_АктуальныеДокументыКонсервацииПомещений.Дата, НЕДЕЛЯ) КАК Дата,
		//               |	гхб_АктуальныеДокументыКонсервацииПомещений.Помещение КАК Помещение,
		//               |	МАКСИМУМ(гхб_АктуальныеДокументыКонсервацииПомещений.ДокументКонсервации.СтатусКонсервации) КАК ДокументКонсервацииСтатусКонсервации
		//               |ПОМЕСТИТЬ _Периоды
		//               |ИЗ
		//               |	РегистрСведений.гхб_АктуальныеДокументыКонсервацииПомещений КАК гхб_АктуальныеДокументыКонсервацииПомещений
		//               |ГДЕ
		//               |	гхб_АктуальныеДокументыКонсервацииПомещений.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		//               |
		//               |СГРУППИРОВАТЬ ПО
		//               |	НАЧАЛОПЕРИОДА(гхб_АктуальныеДокументыКонсервацииПомещений.Дата, НЕДЕЛЯ),
		//               |	гхб_АктуальныеДокументыКонсервацииПомещений.Помещение
		//               |
		//               |ИНДЕКСИРОВАТЬ ПО
		//               |	Помещение
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |ВЫБРАТЬ
		//               |	ЕСТЬNULL(_Периоды.Дата, _Помещения.Дата) КАК Дата,
		//			   |	_Помещения.ДатаСтрокаЗаголовка КАК ДатаСтрокаЗаголовка,
		//               |	_Помещения.Помещение КАК Помещение,
		//               |	ЕСТЬNULL(_Периоды.ДокументКонсервацииСтатусКонсервации, _Помещения.СтатусКонсервации) КАК ДокументКонсервацииСтатусКонсервации
		//               |ИЗ
		//               |	_Помещения КАК _Помещения
		//               |		ЛЕВОЕ СОЕДИНЕНИЕ _Периоды КАК _Периоды
		//               |		ПО _Помещения.Помещение = _Периоды.Помещение И _Помещения.Дата = _Периоды.Дата
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |УНИЧТОЖИТЬ _Периоды
		//               |;
		//               |
		//               |////////////////////////////////////////////////////////////////////////////////
		//               |УНИЧТОЖИТЬ _Помещения";
		
		Дата1 = НачалоНедели(ПользНастройкаДата1.Значение);
		Дата2 = НачалоДня(КонецНедели(ПользНастройкаДата2.Значение));
		
		ЗапросПомещения = Новый Запрос();
		ЗапросПомещения.Текст = "ВЫБРАТЬ
		                        |	гхб_Помещения.Ссылка КАК Помещение
		                        |ИЗ
		                        |	Справочник.гхб_Помещения КАК гхб_Помещения
		                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гхб_СвойстваПомещений.СрезПоследних КАК гхб_СвойстваПомещенийСрезПоследних
		                        |		ПО гхб_Помещения.Ссылка = гхб_СвойстваПомещенийСрезПоследних.Помещение
		                        |ГДЕ
		                        |	гхб_Помещения.Ссылка В ИЕРАРХИИ(&Помещения)
		                        |	И НЕ гхб_Помещения.ПометкаУдаления
		                        |	И НЕ гхб_Помещения.ЭтоГруппа
		                        |	И НЕ гхб_СвойстваПомещенийСрезПоследних.Закрыть
		                        |	И гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ЭтоПомещение
		                        |	И гхб_СвойстваПомещенийСрезПоследних.ТипПомещения.ИспользоватьДляКонсервацииПомещений";
		
		ЗапросПомещения.УстановитьПараметр("Помещения", РегистрыСведений.гхб_ОтветственныеЗаКонсервациюПомещений.ВернутьПомещенияДляОтбораПоКонсервацииТекущийПользователь());
		
		//_ТЗПериоды = ВернутьПериодыДляОтчета(Дата1, Дата2, ЗапросПомещения.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение"));
		//
		//Запрос.УстановитьПараметр("ДатаНачала", Дата1);
		//Запрос.УстановитьПараметр("ДатаОкончания", Дата2);
		//Запрос.УстановитьПараметр("ТЗПериоды", _ТЗПериоды);
		
		_ТЗ = РегистрыСведений.гхб_АктуальныеДокументыКонсервацииПомещений.ВернутьСтатусыКонсервацииВПериоде(Дата1, Дата2, ЗапросПомещения.Выполнить().Выгрузить().ВыгрузитьКолонку("Помещение"));

		НаборыДанных = Новый Структура();
		НаборыДанных.Вставить("ТЗПериоды", _ТЗ);
	
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
		    
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, НаборыДанных, ДанныеРасшифровки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
КонецПроцедуры

Функция ПользовательскаяНастройкаПараметра(ИмяПараметра, КомпоновщикНастроек)

	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ПараметрДанных <> Неопределено Тогда
		ПараметрПользовательскойНастройки = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
		Если ПараметрПользовательскойНастройки <> Неопределено Тогда
			Возврат ПараметрПользовательскойНастройки;
		Иначе
			Возврат ПараметрДанных;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

#КонецОбласти
